{"pageProps":{"title":"How I built my Startup as a solo developer","date":"","content":"\n> This article will detail my journey from a Full Stack Engineer to Startup founder over the course of 10 months. Throughout this article I’ll explain the rationale behind choosing each part of my stack and how it played out in the end.\n\nSo strap in, it is going to be a long yet fun article!\n> \n\n## So what is my Startup about ?\n\nWell it took a couple weeks to get a clean pitch drafted so I’ll lead with that.\n\n> skillShack(⚡); is a community for software professionals looking to share the projects they are working on and get feedback. From side projects to startups!\n> \n\n![caption](https://braggi-free-bucket.s3.ap-south-1.amazonaws.com/banner-m-11640954836966.png)\n\n\n![caption](https://braggi-free-bucket.s3.ap-south-1.amazonaws.com/banner-m-21640954903701.png)\n\n![caption](https://braggi-free-bucket.s3.ap-south-1.amazonaws.com/banner-m-31640954903705.png)\n\n\nWith “skillShack(⚡);” I wanted to build a platform for developers to share the projects they are working on, and for those stuck in tutorial hell provide a curated list of challenges that can be built into projects to put their skills to use.\n\nIt has been my firm belief since the start that you can only get better at Software Development by actually DEVELOPING SOFTWARE (obvious right ?) and yet most people engage in endless sprints of watching tutorial after tutorial to add new buzz words to their Resumes. Most coding centric platforms online have catered to the problem solving aspects of programming, which while giving you a good understanding of the fundamentals of the language and engaging your intellect have diminishing returns after a while.\n\nSo I set out to build this platform with hopes of providing a safe space for developers to share their projects, get feedback from the community and learn from one another.\n\n## Deciding on a Stack\n\nOnce I wrote down all the features I would want to make the experience truly unique, I set out to finalise a tech stack. I needed the following attributes:\n\n- Easy to Scale and Deploy\n- A Good ORM with a strong API and support for formatted output on Raw Queries.\n- React on the frontend (it’s 2021 or 2022 by the time you read this)\n- Excellent SEO Support\n- PWA Support\n- Admin tools that were served separately from the main website\n- Social Authentication\n- GitHub Integration so that users can link their repositories.\n\nFor each requirement I put together a list of possible technologies/frameworks.\n\n## The Stack\n\n- Frontend: Next.js\n- Backend: Express.js\n- Database: PostgreSQL with Sequelize ORM\n- Admin Tools: react-admin\n- DevOps: GitHub Actions, Vercel CLI and Docker\n- Hosting:\n    - AWS EC2 (Backend)\n    - Vercel (Both Frontends)\n\n### Why Next.js ?\n\nAs stated earlier SEO was crucial for me, and with create-react-app you subscribe to Client-Side Rendering which will not play well with Web Crawlers of Search Engines (they do not execute JS).\n\nNext.js supports SSR(Server Side Rendering), SSG (Static Site Generation) and ISR (Incremental Static Regeneration). I’ll summarize each in simple terms below:\n\n- SSR: Essentially serves documents with all the components rendered and populated with necessary data (from APIs). This way a bot can see all the info without the need for JavaScript execution. This makes serving pages with no real time updates like Blogs, Profile data etc simple and allows for good SEO.\n- SSG: It serves purely static pages (No API data), and offers good SEO at the same time. Useful for things like documentation.\n- ISR: It’s like SSR but it periodically refreshes the static Pages with new API data. Useful for things like blogs and profiles where updates may not be frequent but do happen and must be reflected.\n\nBonus: Next.js and Vercel have the perfect ecosystem.\n\n### Authentication: next-auth\n\nIt couples perfectly with Next.js, its served as a serverless function via Next.js which fully supports them and Vercel does too in production, so no extra configurations. You can even remotely monitor the function and check for errors through Vercel. It is perfect in every way, you should just look at their website to learn more.\n\nThe docs were simple and I was able to setup Google and GitHub authentication in under an hour (had to wait for Google to sync callback urls).\n\n### Component Library: material-ui\n\nI started the project before the Tailwind hype train hit its peak. And I did eventually try it on another project, but it’s not my kind of thing. I’m very good at pure CSS already so I went with material-ui, it comes with a good set of components out of the box and a few more from other community made packages like treasury, pickers etc.\n\n### Admin Tools: react-admin\n\nIt comes with a good set of tools out of the box it makes use of material-ui (so easier to customize and share components). Plus you can easily assign roles and give restricted access to different aspects of the App.\n\n### Backend: Express.js\n\nExpress has been around since forever and it is pretty much the goto for most people. I added a few packages like express-sequelize-crud so that I could allow my admin tools to query it easily without the need for more endpoints. Secured all the endpoints with JWT authentication and setup Role Based Permissions.\n\n### Database: PostgreSQL\n\nThis project was going to have a lot of inter linked tables, so No SQL was not going to cut it. I also needed support for JSON documents to store certain nested data (Resumes). PostgreSQL also supports Full-Text Search (FTS) out of the box which made it easier to build a feature rich Search option.\n\nSequelize was good, it supported TS_Vectors out of the box which was necessary for me to build FTS supported documents. And the support for formatted Raw Queries made writing joins simpler (kind of a pain doing it through the ORM’s native API).\n\n### Deployment\n\nSo my deployment workflow goes as follows:\n\n- Merge a Pull Request to main to Trigger GitHub Actions.\n- Build Preview Deployments for the admin and main website on Vercel.\n- Once the Preview build is built successfully, promote it to production. (I get notifications for each step on Slack thanks to a sweet Slack Integration).\n- In parallel a docker image is created with contents of the backend code and pushed to my EC2 instance, where its run with pm2. A script then performs necessary database migrations via sequelize-cli.\n\n## Closing thoughts\n\nIt was a great journey building out the whole project by myself, I learnt a lot of thing along the way including Canva and Figma. Spent a lot of time binging YC Startup School videos to figure out my pitch, website content. I also tweeted my entire journey on Twitter, which was great because I got to connect with a lot of cool people.\n\nI’m excited to close this article by saying skillShack(⚡); is live at skillshack.dev!\n\nWould love to hear your thoughts in the comments!\n","cover_img_url":"https://braggi-free-bucket.s3.ap-south-1.amazonaws.com/banner-m-21640954520466.png","description":"\n> This article will detail my journey from a Full Stack Engineer to Startup founder over the course of 10 months. Throughout this article I’ll explain the rati"},"__N_SSG":true}